glocklueng/032/LayerOne_2014/badge/code/stm32-prox/armsrc/fpgaloader.c
}

// Download the fpga image starting at FpgaImage and with length FpgaImageLen bytes
// If bytereversal is set: reverse the byte order in each 4-byte word
static void DownloadFPGA ( const char *FpgaImage, int FpgaImageLen, int bytereversal )
{
	int i=0;

	OLEDPutstr ( "FPGA SETUP\n" );
	OLEDDraw();

	LOW ( NVDD_ON );                // Enable p-Channel MOSFET
	SpinDelay ( 50 );
	HIGH ( FPGAON );                // Enable VREG's

	OLEDPutstr ( "FPGA POWERED\n" );
	OLEDDraw();

	// Let VREG's settle down
	DelaymS ( 200 );

	// setup initial logic state
	HIGH ( GPIO_FPGA_NPROGRAM );
	LOW ( GPIO_FPGA_CCLK );
	LOW ( GPIO_FPGA_DIN );

	DelayuS ( 100 );

	// enter FPGA configuration mode
	LOW ( GPIO_FPGA_NPROGRAM );
	SpinDelay ( 50 );
	HIGH ( GPIO_FPGA_NPROGRAM );

	i=100000;

	// wait for FPGA ready to accept data signal, see UG331.PDF
	while ( ( i ) && ( ! ( GETBIT ( GPIO_FPGA_NINIT ) ) ) ) {
		i--;
	}

	// error indicator, tell user failed at ninit
	if ( i==0 ) {
		OLEDPutstr ( "FPGA FAILED NINIT\n" );
		OLEDDraw();
		i = 50;

		// get users attention
		while ( i-- ) {
			InvertOLED ( 1 );
			DelaymS ( 100 );
			InvertOLED ( 0 );
			DelaymS ( 100 );
		}

		return;
	}

	OLEDPutstr ( "FPGA BITSTREAM DOWNLOAD\n" );
	OLEDDraw();

	if ( bytereversal ) {
		/* This is only supported for DWORD aligned images */
		if ( ( ( int ) FpgaImage % sizeof ( DWORD ) ) == 0 ) {
			i=0;

			while ( FpgaImageLen-->0 ) {
				DownloadFPGA_byte ( FpgaImage[ ( i++ ) ^0x3] );
			}

			/* Explanation of the magic in the above line:
			 * i^0x3 inverts the lower two bits of the integer i, counting backwards
			 * for each 4 byte increment. The generated sequence of (i++)^3 is
			 * 3 2 1 0 7 6 5 4 11 10 9 8 15 14 13 12 etc. pp.
			 */
		}
	}

	else {
		while ( FpgaImageLen-->0 ) {
			DownloadFPGA_byte ( *FpgaImage++ );
		}
	}

	// continue to clock FPGA until ready signal goes high
	i=100000;

	while ( ( i ) && ( ! ( GETBIT ( GPIO_FPGA_DONE ) ) ) ) {
		HIGH ( GPIO_FPGA_CCLK );
		LOW ( GPIO_FPGA_CCLK );
		i--;
	}

	// error indicator
	if ( i== 0 ) {

		OLEDPutstr ( "FPGA FAILED TO ACK DONE\nCHECK FPGA\n" );
		OLEDDraw();

		i = 50;

		// get users attention
		while ( i-- ) {

			InvertOLED ( 1 );
			DelaymS ( 100 );
			InvertOLED ( 0 );
			DelaymS ( 100 );
		}

		return;
	}

	OLEDPutstr ( "FPGA BITSTREAM LOADED\n" );
	OLEDDraw();

	FPGA_NCS_HIGH();
	FPGA_MOSI_HIGH();
	FPGA_SPCK_HIGH();

}

static char *bitparse_headers_start;
static char *bitparse_bitstream_end;
static int bitparse_initialized;
/* Simple Xilinx .bit parser. The file starts with the fixed opaque byte sequence
 * 00 09 0f f0 0f f0 0f f0 0f f0 00 00 01
 * After that the format is 1 byte section type (ASCII character), 2 byte length
 * (big endian), <length> bytes content. Except for section 'e' which has 4 bytes
 * length.
 */
static const char _bitparse_fixed_header[] = {0x00, 0x09, 0x0f, 0xf0, 0x0f, 0xf0, 0x0f, 0xf0, 0x0f, 0xf0, 0x00, 0x00, 0x01};
static int bitparse_init ( void * start_address, void *end_address )
{
	bitparse_initialized = 0;

	if ( memcmp ( _bitparse_fixed_header, start_address, sizeof ( _bitparse_fixed_header ) ) != 0 ) {
		return 0; /* Not matched */
	}

	else {
		bitparse_headers_start= ( ( char* ) start_address ) + sizeof ( _bitparse_fixed_header );
		bitparse_bitstream_end= ( char* ) end_address;
		bitparse_initialized = 1;
		return 1;
	}
}

int bitparse_find_section ( char section_name, char **section_start, unsigned int *section_length )
{
	char *pos = bitparse_headers_start;
	int result = 0;

	if ( !bitparse_initialized ) {
		return 0;
	}

	while ( pos < bitparse_bitstream_end ) {
		char current_name = *pos++;
		unsigned int current_length = 0;

		if ( current_name < 'a' || current_name > 'e' ) {
			/* Strange section name, abort */
			break;
		}

		current_length = 0;

		switch ( current_name ) {
			case 'e':
				/* Four byte length field */
				current_length += ( *pos++ ) << 24;
				current_length += ( *pos++ ) << 16;

			default: /* Fall through, two byte length field */
				current_length += ( *pos++ ) << 8;
				current_length += ( *pos++ ) << 0;
		}

		if ( current_name != 'e' && current_length > 255 ) {
			/* Maybe a parse error */
			break;
		}

		if ( current_name == section_name ) {
			/* Found it */
			*section_start = pos;
			*section_length = current_length;
			result = 1;
			break;
		}

		pos += current_length; /* Skip section */
	}

	return result;
}


//-----------------------------------------------------------------------------
// Find out which FPGA image format is stored in flash, then call DownloadFPGA
// with the right parameters to download the image
//-----------------------------------------------------------------------------
static const char _binary_fpga_bit_start[] = {

  

#if BOARD_REVISION == 3

	#include "fpga.h"
	//#include "fpga_test.h"
  	// copy the adc out
	//#include "fpga_adc.h"

	//#include "fpga_counter.h"
	//#include "fpga_constant.h"
  
#else
#include "fpga_rev2.h"
#endif
};

static const char *_binary_fpga_bit_end=_binary_fpga_bit_start+sizeof ( _binary_fpga_bit_start );

void FpgaDownloadAndGo ( void )
{
	/* Check for the new flash image format: Should have the .bit file at &_binary_fpga_bit_start
	 */
	if ( bitparse_init ( ( void* ) &_binary_fpga_bit_start, ( void* ) _binary_fpga_bit_end ) ) {
		/* Successfully initialized the .bit parser. Find the 'e' section and
		 * send its contents to the FPGA.
		 */
		char *bitstream_start;
		unsigned int bitstream_length;

		if ( bitparse_find_section ( 'e', &bitstream_start, &bitstream_length ) ) {
			DownloadFPGA ( bitstream_start, bitstream_length, 0 );

			return; /* All done */
		}
	}

	/* Fallback for the old flash image format: Check for the magic marker 0xFFFFFFFF
	 * 0xAA995566 at address 0x102000. This is raw bitstream with a size of 336,768 bits
	 * = 10,524 DWORDs, stored as DWORDS e.g. little-endian in memory, but each DWORD
	 * is still to be transmitted in MSBit first order. Set the invert flag to indicate
	 * that the DownloadFPGA function should invert every 4 byte sequence when doing
	 * the bytewise download.
	 */
	if ( * ( uint32_t* ) 0x102000 == 0xFFFFFFFF && * ( uint32_t* ) 0x102004 == 0xAA995566 ) {
		DownloadFPGA ( ( char* ) 0x102000, 10524*4, 1 );
	}
}

