glocklueng/032/LayerOne_2014/badge/code/stm32-prox/armsrc/fpgaloader.c
//-----------------------------------------------------------------------------
// Set up the synchronous serial port, with the one set of options that we
// always use when we are talking to the FPGA. Both RX and TX are enabled.
//-----------------------------------------------------------------------------
void FpgaSetupSsc ( unsigned char on_off )
{

#if BOARD_REVISION == 3

	SPI_InitTypeDef  SPI_InitStructure;

	if ( on_off ) {
		/*-----------------ARKO'S TEST CODE - SPI SLAVE-----------------------------*/
		// Start SPI Slave
		RCC_APB2PeriphClockCmd ( RCC_APB2Periph_GPIOB, ENABLE );

		/* Enable SPI2 Periph clock */
		RCC_APB1PeriphClockCmd ( RCC_APB1Periph_SPI2, ENABLE );

		GPIO_InitTypeDef GPIO_InitStructure;
		/* Configure SPIz pins: SCK, MISO and MOSI */
		//GPIO_InitStructure.GPIO_Pin = SSP_FRAME_PIN | SSP_DIN_PIN |SSP_DOUT_PIN | SSP_CLK_PIN;
		//GPIO_Init(GPIOB, &GPIO_InitStructure);

		SPI_InitStructure.SPI_Direction = SPI_Direction_1Line_Rx;
		SPI_InitStructure.SPI_Mode = SPI_Mode_Slave;
		SPI_InitStructure.SPI_DataSize = SPI_DataSize_16b;
		SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;   // high
		SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;  // 1edge // Sample on clock falling edge
		SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
		SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
		SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
		SPI_InitStructure.SPI_CRCPolynomial = 15;
		SPI_Init ( SPI2, &SPI_InitStructure );

		/* Enable SPIz */
		SPI_Cmd ( SPI2, ENABLE );
	}

	NVIC_InitTypeDef   NVIC_InitStructure;

	/* Enable and set EXTIn Interrupt to the lowest priority */
	NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQChannel;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 4;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 4;

	if ( on_off == 1 ) {
		NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	}

	else {
		NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
	}

	NVIC_Init ( &NVIC_InitStructure );

	return;

	NVIC_InitStructure.NVIC_IRQChannel = EXTI2_IRQChannel;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;

	if ( on_off == 1 ) {
		NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
	}

	else {
		NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
	}

	NVIC_Init ( &NVIC_InitStructure );

#else
#endif


}


void FpgaDisableSscDma ( void )
{
  	/* Enable DMA */
	DMA_Cmd ( SPI_SLAVE_RX_DMA, DISABLE );

	SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Rx , DISABLE);

}

void FpgaEnableSscDma ( void )
{
  	/* Enable DMA */
	DMA_Cmd ( SPI_SLAVE_RX_DMA, ENABLE );

	SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Rx , ENABLE);

}


//-----------------------------------------------------------------------------
// Set up DMA to receive samples from the FPGA. We will use the PDC, with
// a single buffer as a circular buffer (so that we just chain back to
// ourselves, not to another buffer). The stuff to manipulate those buffers
// is in apps.h, because it should be inlined, for speed.
//-----------------------------------------------------------------------------
bool FpgaSetupSscDma ( uint8_t *buf, int len )
{
	DMA_InitTypeDef DMA_InitStructure;
	NVIC_InitTypeDef    NVIC_InitStructure;
	//DMA setup

#if 0
	//Enable DMA1 channel IRQ Channel 
	NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel4_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
#endif
	
	DMA_StructInit ( &DMA_InitStructure );
	RCC_AHBPeriphClockCmd ( RCC_AHBPeriph_DMA1, ENABLE );

	
	/* DMA configuration */
	DMA_DeInit ( SPI_SLAVE_RX_DMA );

	DMA_StructInit( &DMA_InitStructure );
	
	DMA_InitStructure.DMA_PeripheralBaseAddr =  ( uint32_t ) &SPI2->DR;
	DMA_InitStructure.DMA_MemoryBaseAddr = ( uint32_t ) buf;
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;	// from device to cpu
	DMA_InitStructure.DMA_BufferSize = len;
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	
	// a word is 32 bits... halfword 16 bit....
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
	
	DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
	DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
	DMA_Init ( SPI_SLAVE_RX_DMA, &DMA_InitStructure );

	/* Enable DMA Transfer Complete interrupt */
	DMA_ITConfig ( SPI_SLAVE_RX_DMA, DMA_IT_TC, ENABLE );


	return true;
}


// DMA buffer

uint8_t fpga_dma_buffer[];
#if 0
uint16_t TxIdx = 0;
uint16_t RxIdx = 0;
uint16_t SPIz_Buffer_Tx[BufferSize] = {0xFFFF};

static uint16_t SPIy_Buffer_Rx[BufferSize], SPIz_Buffer_Rx[BufferSize];

while ( GETBIT ( SSP_FRAME  ) == 0 );

/* Transfer procedure */
while ( RxIdx < BufferSize )
{
	/* Wait for SPIz data reception */
	while ( SPI_I2S_GetFlagStatus ( SPI2, SPI_I2S_FLAG_RXNE ) == RESET );

	/* Read SPIz received data */
	SPIz_Buffer_Rx[RxIdx] = SPI_I2S_ReceiveData ( SPI2 );
	RxIdx++;
}

/*-------------- END ARKO'S TEST CODE - SPI SLAVE---------------------------*/

#endif
